In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randn(4,3) ## 4 tane sıra 3 kolodna oluşan dağılmış yapı getirir matrix yapısı

In [3]:
data

array([[-1.24033237, -1.00325992,  0.3623935 ],
       [-0.1324108 ,  1.91829885,  0.41189903],
       [-1.31115225,  0.47162712,  1.28686497],
       [-0.37830132, -0.95883833,  1.32905929]])

In [4]:
dataFrame = pd.DataFrame(data)

In [5]:
dataFrame[0]  ##kolon olrak karşımıza getiriyor not row

0   -1.240332
1   -0.132411
2   -1.311152
3   -0.378301
Name: 0, dtype: float64

In [6]:
dataFrame

          0         1         2
0 -1.240332 -1.003260  0.362393
1 -0.132411  1.918299  0.411899
2 -1.311152  0.471627  1.286865
3 -0.378301 -0.958838  1.329059

In [7]:
yeniDataFrame= pd.DataFrame(data,index=["batu","sülo","kel","merdo"],columns=["Maas","Yas","Calisma saati"])

In [8]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [9]:
yeniDataFrame["Yas"]

batu    -1.003260
sülo     1.918299
kel      0.471627
merdo   -0.958838
Name: Yas, dtype: float64

In [10]:
yeniDataFrame["Calisma saati"]

batu     0.362393
sülo     0.411899
kel      1.286865
merdo    1.329059
Name: Calisma saati, dtype: float64

In [11]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [12]:
yeniDataFrame [["Maas","Yas"]]

           Maas       Yas
batu  -1.240332 -1.003260
sülo  -0.132411  1.918299
kel   -1.311152  0.471627
merdo -0.378301 -0.958838

In [13]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [14]:
yeniDataFrame.loc [ "batu"]

Maas            -1.240332
Yas             -1.003260
Calisma saati    0.362393
Name: batu, dtype: float64

In [15]:
yeniDataFrame.loc["sülo"]

Maas            -0.132411
Yas              1.918299
Calisma saati    0.411899
Name: sülo, dtype: float64

In [16]:
yeniDataFrame.iloc[1]

Maas            -0.132411
Yas              1.918299
Calisma saati    0.411899
Name: sülo, dtype: float64

In [17]:
yeniDataFrame.iloc[0]

Maas            -1.240332
Yas             -1.003260
Calisma saati    0.362393
Name: batu, dtype: float64

In [18]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [19]:
yeniDataFrame["Emeklilik"] = yeniDataFrame["Yas"] + yeniDataFrame["Yas"]

In [20]:
yeniDataFrame

           Maas       Yas  Calisma saati  Emeklilik
batu  -1.240332 -1.003260       0.362393  -2.006520
sülo  -0.132411  1.918299       0.411899   3.836598
kel   -1.311152  0.471627       1.286865   0.943254
merdo -0.378301 -0.958838       1.329059  -1.917677

In [21]:

yeniDataFrame.drop("Emeklilik",axis=1)

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [22]:
yeniDataFrame.drop("kel",axis=0)

           Maas       Yas  Calisma saati  Emeklilik
batu  -1.240332 -1.003260       0.362393  -2.006520
sülo  -0.132411  1.918299       0.411899   3.836598
merdo -0.378301 -0.958838       1.329059  -1.917677

In [23]:
yeniDataFrame

           Maas       Yas  Calisma saati  Emeklilik
batu  -1.240332 -1.003260       0.362393  -2.006520
sülo  -0.132411  1.918299       0.411899   3.836598
kel   -1.311152  0.471627       1.286865   0.943254
merdo -0.378301 -0.958838       1.329059  -1.917677

In [24]:
yeniDataFrame.drop("Emeklilik",axis = 1,inplace = True)  ##inplace true komutuyla datamızı kendisinden ssildik!!!!!

In [25]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [26]:
yeniDataFrame.loc["kel","Yas"]

0.4716271245212391

In [27]:
yeniDataFrame.loc["kel"]["Yas"]

0.4716271245212391

In [28]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [29]:
booleanFrame = yeniDataFrame < 0

In [30]:
booleanFrame

       Maas    Yas  Calisma saati
batu   True   True          False
sülo   True  False          False
kel    True  False          False
merdo  True   True          False

In [31]:
yeniDataFrame[booleanFrame]

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260            NaN
sülo  -0.132411       NaN            NaN
kel   -1.311152       NaN            NaN
merdo -0.378301 -0.958838            NaN

In [32]:
yeniDataFrame[yeniDataFrame< 0]

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260            NaN
sülo  -0.132411       NaN            NaN
kel   -1.311152       NaN            NaN
merdo -0.378301 -0.958838            NaN

In [33]:
yeniDataFrame[yeniDataFrame["Maas"]>0]

Empty DataFrame
Columns: [Maas, Yas, Calisma saati]
Index: []

In [34]:
yeniDataFrame.reset_index()

   index      Maas       Yas  Calisma saati
0   batu -1.240332 -1.003260       0.362393
1   sülo -0.132411  1.918299       0.411899
2    kel -1.311152  0.471627       1.286865
3  merdo -0.378301 -0.958838       1.329059

In [35]:
yeniDataFrame

           Maas       Yas  Calisma saati
batu  -1.240332 -1.003260       0.362393
sülo  -0.132411  1.918299       0.411899
kel   -1.311152  0.471627       1.286865
merdo -0.378301 -0.958838       1.329059

In [36]:
yeniIndexListesi = ["Bat","sül","mer","kel"]

In [37]:
yeniDataFrame["Yeni index"] = yeniIndexListesi

In [38]:
yeniDataFrame

           Maas       Yas  Calisma saati Yeni index
batu  -1.240332 -1.003260       0.362393        Bat
sülo  -0.132411  1.918299       0.411899        sül
kel   -1.311152  0.471627       1.286865        mer
merdo -0.378301 -0.958838       1.329059        kel

In [39]:
yeniDataFrame.set_index("Yeni index")

                Maas       Yas  Calisma saati
Yeni index
Bat        -1.240332 -1.003260       0.362393
sül        -0.132411  1.918299       0.411899
mer        -1.311152  0.471627       1.286865
kel        -0.378301 -0.958838       1.329059

In [40]:
yeniDataFrame

           Maas       Yas  Calisma saati Yeni index
batu  -1.240332 -1.003260       0.362393        Bat
sülo  -0.132411  1.918299       0.411899        sül
kel   -1.311152  0.471627       1.286865        mer
merdo -0.378301 -0.958838       1.329059        kel

In [41]:
yeniDataFrame.set_index("Yeni index",inplace=True)

In [42]:
yeniDataFrame

                Maas       Yas  Calisma saati
Yeni index
Bat        -1.240332 -1.003260       0.362393
sül        -0.132411  1.918299       0.411899
mer        -1.311152  0.471627       1.286865
kel        -0.378301 -0.958838       1.329059

In [43]:
yeniDataFrame.loc["sül"]

Maas            -0.132411
Yas              1.918299
Calisma saati    0.411899
Name: sül, dtype: float64

In [61]:
ilkIndeksler = ["oda1","oda1","oda1","oda2","oda2","oda2"]

In [62]:
icIndexler = ["burak","sülo","merdo","batu","burağın avradı","burağın avradı2"]

In [63]:
birlesmisIndeks =list(zip(ilkIndeksler,icIndexler))

In [64]:
birlesmisIndeks

[('oda1', 'burak'),
 ('oda1', 'sülo'),
 ('oda1', 'merdo'),
 ('oda2', 'batu'),
 ('oda2', 'burağın avradı'),
 ('oda2', 'burağın avradı2')]

In [65]:
birlesmisIndeks = pd.MultiIndex.from_tuples(birlesmisIndeks)

In [66]:
birlesmisIndeks

MultiIndex([('oda1',           'burak'),
            ('oda1',            'sülo'),
            ('oda1',           'merdo'),
            ('oda2',            'batu'),
            ('oda2',  'burağın avradı'),
            ('oda2', 'burağın avradı2')],
           )

In [67]:
benimOdaListem = [[40,"a"],[30,"b"],[30,"c"],[9,"d"],[4,"d"],[56,"n"]]

In [68]:
odaDizisiNumpy= np.array(benimOdaListem)

In [69]:
odaDataFrame = pd.DataFrame(odaDizisiNumpy,index = birlesmisIndeks,columns = ["atılan posta","meslek"])

In [70]:
odaDataFrame

                     atılan posta meslek
oda1 burak                     40      a
     sülo                      30      b
     merdo                     30      c
oda2 batu                       9      d
     burağın avradı             4      d
     burağın avradı2           56      n

In [75]:
odaDataFrame.loc["oda1"].loc["sülo"]

atılan posta    30
meslek           b
Name: sülo, dtype: object

In [73]:
odaDataFrame.loc["oda2"]

                atılan posta meslek
batu                       9      d
burağın avradı             4      d
burağın avradı2           56      n

In [76]:
odaDataFrame

                     atılan posta meslek
oda1 burak                     40      a
     sülo                      30      b
     merdo                     30      c
oda2 batu                       9      d
     burağın avradı             4      d
     burağın avradı2           56      n

In [77]:
odaDataFrame.index.names = ["Oda No","İsim"]

In [78]:
odaDataFrame

                       atılan posta meslek
Oda No İsim
oda1   burak                     40      a
       sülo                      30      b
       merdo                     30      c
oda2   batu                       9      d
       burağın avradı             4      d
       burağın avradı2           56      n